FemDesign.Results.NodalDisplacement
FemDesign "Nodal displacements" result

FemDesign.Results.NodalDisplacement.Id
Support name identifier

FemDesign.Results.NodalDisplacement.NodeId
Finite element node id

FemDesign.Results.NodalDisplacement.Ex
Displacement in global x

FemDesign.Results.NodalDisplacement.Ey
Displacement in global y

FemDesign.Results.NodalDisplacement.Ez
Displacement in global z

FemDesign.Results.NodalDisplacement.Fix
Rotation around global x

FemDesign.Results.NodalDisplacement.Fiy
Rotation around global y

FemDesign.Results.NodalDisplacement.Fiz
Rotation around global z

FemDesign.Results.NodalDisplacement.CaseIdentifier
Load case or combination name

FemDesign.Results.NodalDisplacement.DeconstructNodalDisplacements(System.Collections.Generic.List{FemDesign.Results.NodalDisplacement},System.String)
The method has been created for returning the value for Grasshopper and Dynamo.
The method can still be use for C# users.